Revit 2024 API
Units.DigitGroupingSymbol Property
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DigitGroupingSymbol DigitGroupingSymbol { get; set; }
Visual Basic
Public Property DigitGroupingSymbol As DigitGroupingSymbol
	Get
	Set
Visual C++
public:
property DigitGroupingSymbol DigitGroupingSymbol {
	DigitGroupingSymbol get ();
	void set (DigitGroupingSymbol value);
}
Field Value
 The digit grouping symbol. The default is Comma.
Remarks
 This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace